[
  {
    "slug" : "rachel-andrew",
    "first" : "Rachel",
    "last" : "Andrew",
    "feature": true,
    "twitter" : "rachelandrew",
    "pic" : "rachelandrew.jpg",
    "bio" : "<p>Rachel Andrew lives in Bristol, England. She is one half of web development company <a href=\"http://edgeofmyseat.com\">edgeofmyseat.com</a>, the company behind Perch CMS (<a href=\"https://grabaperch.com\">grabaperch.com</a>).</p><p>Rachel has been working on the web since 1996 and writing about the web for almost as long. Her books include the recent Get Ready for CSS Grid Layout and HTML5 for Web Designers second edition. She is a regular columnist for A List Apart as well as other publications online and print. You can find her on Twitter as <a href=\"https://twitter.com/rachelandrew\">@rachelandrew</a> and writing about technology and business on her blog at <a href=\"https://rachelandrew.co.uk\">rachelandrew.co.uk</a>.</p>",
    "sessions" : [ ]
  },
  {
    "slug" : "ola-gasidlo",
    "first" : "Ola",
    "last" : "Gasidlo",
    "feature": true,
    "twitter" : "",
    "pic" : "olagasidlo.jpg",
    "bio" : "Ola is a senior engineer at Styla living in Berlin, who is very passionate about Open Source, the Offline First concept and Hoodie. She loves making the web accessible for everyone, riding the trails, and daughter-driven development.",
    "sessions" : []
  },
  {
    "slug" : "lena-reinhard",
    "first" : "Lena",
    "last" : "Reinhard",
    "feature": true,
    "twitter" : "",
    "pic" : "lenareinhard.jpg",
    "bio" : "Lena Reinhard is a consultant, team leader, and former CEO with an interdisciplinary background. She has co-founded a software company and contributed to the Open Source projects Hoodie and Apache CouchDB. Lena has also co-organised tech conferences and has been an editor for the feminist blog Kleinerdrei.org. Through her work, Lena aims to support change in the tech industry to make it more accessible, diverse and inclusive. She currently lives in Berlin and really loves Alpacas.",
    "sessions" : []
  },
  {
    "slug" : "jen-simmons",
    "first" : "Jen",
    "last" : "Simmons",
    "feature": true,
    "twitter" : "",
    "pic" : "jensimmons.jpg",
    "bio" : "<p>Dubbed “the Terry Gross of the tech industry,” Jen Simmons is the host and executive producer of <a href=\"http://thewebahead.net\">The Web Ahead</a>. Her in-depth interviews explain emerging technology and predict the future of the web — and won the 2015 Net Award for Podcast of the Year.</p><p>Jen is a Designer and Developer Advocate at Mozilla, where she advocates for web standards and researches the coming revolution in graphic design on the web. She’s spoken at events including SXSW, An Event Apart, Fluent, Generate, Future of Web Design, and Respond. Her talk, <em>Modern Layouts: Getting Out of Our Ruts</em>, was awarded Best Conference Presentation at CSS Dev Conf 2014.</p>",
    "sessions" : []
  }
]
