[
  {
    "slug" : "monday-registration",
    "title" : "Registration Opens",
    "keynote" : false,
    "time" : "4:30 PM",
    "date" : "2016-11-01",
    "place" : "Lobby",
    "speakers" : [],
    "summary" : ""

  },
  {
    "slug" : "welcome",
    "title" : "Welcome Reception",
    "keynote" : false,
    "time" : "5:30PM",
    "date" : "2016-11-01",
    "place" : "The Armory, 128 NW 11th Ave.",
    "speakers" : [],
    "summary" : "Join us at the Gerding Theater at the Armory for 60 minutes of Ignite lightning talks, snacks, and a chance to meet your fellow attendees."

  },
  {
    "slug" : "ignite",
    "title" : "Ignite View Source",
    "keynote" : false,
    "time" : "6:00PM",
    "date" : "2016-11-01",
    "place" : "The Armory, 128 NW 11th Ave.",
    "speakers" : [],
    "summary" : "<p>View Source is proud to host Ignite Talks at the Armory, Gerding Theater in Portland, Oregon on the evening of November 2nd. Ignite is a fast-paced geek event where speakers are given 20 slides, each shown for 15 seconds, giving each speaker 5 minutes to share their passion. Overall theme for talks is “Building the Future, Today.” We look forward to receiving your creative, exciting, quirky, and fun submissions! Entries close October 19th 2015. Accepted talks will be notified on a rolling basis.</p><p><a href=\"http://bit.ly/1NEti2a\">Submit your proposals here</a></p><p>Ignite’s mission is “Everyone Speaks”. We believe that public speaking builds confidence in individuals and that events like Ignite build community. Our goal is to make it possible for anyone, anywhere, to learn to present their ideas and their stories. Ignite Talks are a global speaker series. Each speaker get 5 minutes on stage with 20 slides that auto-advance every 15 seconds. Ignite has events in over 250+ cities, universities, businesses and organizations globally, with each Ignite event independently organized by local volunteer organizing teams. Talks presented at each event are recorded and the video uploaded for public viewing. Where possible, Ignite events are livestreamed for free viewing in real time. There are thousands of Ignite videos online on just as many topics.</p>"
  },
  {
    "slug" : "tuesday-registration",
    "title" : "Registration Opens",
    "keynote" : false,
    "time" : "8:00 AM",
    "date" : "2016-11-02",
    "place" : "",
    "speakers" : [],
    "summary" : ""
  },
  {
    "slug" : "tuesday-breakfast",
    "title" : "Breakfast",
    "keynote" : false,
    "time" : "8:30 AM",
    "date" : "2016-11-02",
    "place" : "Main Lobby",
    "speakers" : [],
    "summary" : ""
  },
  {
    "slug" : "the-web-today",
    "title" : "The Web Today",
    "keynote" : true,
    "time" : "9:00 AM",
    "date" : "2016-11-02",
    "place" : "",
    "speakers" : [ "rachel-andrew" ],
    "summary" : "I will talk about the web today. Drawing on personal experience, a study of the industry, and an awful lot of time spent reading standards documents, I will talk about what makes a person a web person."

  },
  {
    "slug" : "realistic-responsive-design",
    "title" : "Realistic Responsive Design",
    "keynote" : false,
    "time" : "10:00am - 11:00am",
    "date" : "11/6/2016",
    "place" : "The Xander Tallemash Memorial Fountain Amphitheatre (North)",
    "speakers" : [
      { "slug" : "ola-gasidlo" }
    ]
    ,
    "summary" : "In an ideal scenario, when you’re going to convert a non-responsive site into a responsive one, you start from scratch and do everything right and perfectly from the beginning. But in reality, starting from scratch is simply not practical or possible for many (or even most) projects. So what can we do to overcome some of the most common obstacles and still get to that elusive, mobile-first, responsive site? In this talk, I’ll go behind the scenes through the nitty-gritty of a real world responsive retrofitting project, and provide useful tips that can be put in practice by other teams facing similar challenges."
  },
  {
    "slug" : "better-for-everyone",
    "title" : "Web Accessibility:  Making Websites Better for Everyone",
    "keynote" : false,
    "time" : "11:00 AM",
    "date" : "2016-11-02",
    "place" : "",
    "speakers" : [ "jen-simmons" ],
    "summary" : "Making our sites easier to use for users who face vision or mobility challenges makes them easier for everyone to use. From larger hit areas to clear indications of state, we’ll cover a few simple things we can start and stop doing with CSS to make websites faster to navigate with a keyboard, easier to use with a coarse pointer, and usable even without visual formatting."
  },
  {
    "slug" : "tuesday-am-break",
    "title" : "Break",
    "keynote" : false,
    "time" : "11:00 AM",
    "date" : "2016-11-02",
    "place" : "",
    "speakers" : [],
    "summary" : ""
  },
  {
    "slug" : "advanced-automation",
    "title" : "Advanced front-end automation with npm scripts",
    "keynote" : false,
    "time" : "11:30 AM",
    "date" : "2016-11-02",
    "place" : "",
    "speakers" : [ "kate-hudson" ],
    "summary" : "With the release of npm 3.0, it's never been a better time to consider using npm scripts for automated front-end workflows."
  },
  {
    "slug" : "web-security",
    "title" : "Web Security Made Easy",
    "keynote" : false,
    "time" : "12:00 PM",
    "date" : "2016-11-02",
    "place" : "",
    "speakers" : [ "albert-yu" ],
    "summary" : "We will take a look at security related bad practices for using common JS template libraries, and explore solutions. We will provide a deep dive into why this solution works. Learn more about HTML5 parsing, various attacks, and how to use our open sourced solution to prevent them."
  },
  {
    "slug" : "tuesday-lunch",
    "title" : "Lunch",
    "keynote" : false,
    "time" : "12:30 PM",
    "date" : "2016-11-02",
    "place" : "",
    "speakers" : [],
    "summary" : ""
  },
  {
    "slug" : "discussion-javascript",
    "title" : "Discussion: JavaScript Today",
    "keynote" : false,
    "time" : "1:30 PM",
    "date" : "2016-11-02",
    "place" : "",
    "speakers" : [
        "ola-gasidlo",
        "lena-reinhard",
        "jen-simmons"
    ],
    "summary" : "What's on your mind about JavaScript today? Discuss with our group of experts and interested attendees!"
  },
  {
    "slug" : "discussion-webapis",
    "title" : "Discussion: WebAPIs today and tomorrow",
    "keynote" : false,
    "time" : "2:15 PM",
    "date" : "2016-11-02",
    "place" : "",
    "speakers" : [ "chris-mills" ],
    "summary" : "New WebAPIs are being worked on all the time — specced out by standards bodes and implemented in browsers — with goals such as efficiency, hack removal, and making the Web more competitive against native platforms. But what are the most important and essential for our work? This discussion hopes to gain some such insights, and produce some new ideas to help improve our work, whether we are web developers or implementers."
  },
  {
    "slug" : "discussion-service-workers",
    "title" : "Discussion: Service Workers",
    "keynote" : false,
    "time" : "1:30 PM",
    "date" : "2016-11-02",
    "place" : "",
    "speakers" : [ "bill-walker", "chris-wilson" ],
    "summary" : "A technical discussion about how to use Service Workers to receive push notifications and cache web app resources and data for offline use."
  },
  {
    "slug" : "wednesday-registration",
    "title" : "Registration Opens",
    "keynote" : false,
    "time" : "8:00 AM",
    "date" : "2016-11-03",
    "place" : "",
    "speakers" : [],
    "summary" : ""
  },
  {
    "slug" : "wednesday-breakfast",
    "title" : "Breakfast",
    "keynote" : false,
    "time" : "8:30 AM",
    "date" : "2016-11-03",
    "place" : "Main Lobby",
    "speakers" : [],
    "summary" : ""
  },
  {
    "slug" : "generalism",
    "title" : "Keynote: The Triumph of Generalism",
    "keynote" : true,
    "time" : "9:30 AM",
    "date" : "2016-11-03",
    "place" : "",
    "speakers" : [ "ola-gasidlo" ],
    "summary" : "<p>We want to be good at what we do, but the web keeps getting more complex. When we try to stretch and understand it all, we inevitably fall short. We languish in imposter syndrome and doubt. But, slowly, we’re realizing the power in being an expert generalist.</p><p>Life for virtuoso generalists is challenging, though. What are our technical touchstones in such a vast sea? And how can we get things done while also satisfying our needs for mastery and accomplishment?</p>"

  },
  {
    "slug" : "web-audio",
    "title" : "Signal processing, perceptual audio, and the web audio api",
    "keynote" : false,
    "time" : "10:00 AM",
    "date" : "2016-11-03",
    "place" : "",
    "speakers" : [ "lena-reinhard" ],
    "summary" : "Let’s use the web audio api to learn about the basics of signal processing and how to brain perceives sound."
  }
]
