[
    {
        "slug" : "marcy-sutton",
        "first" : "Marcy",
        "last" : "Sutton",
        "feature": true,
        "pic" : "marcysutton.jpg",
        "bio" : "Marcy Sutton is a Senior Front-End Engineer at Deque Systems, where she works on the aXe-core team focusing on accessibility test integrations. Marcy is passionate about making the web accessible for everyone. She is a core team member and active contributor to Angular, where she regularly brings her accessibility expertise to the table. Her blog, Accessibility Wins, highlights accessible user interfaces and tools, contributing a positive voice to the web development space.",
        "sessions" : []
        },
    {
        "slug" : "kawandeep-virdee",
        "first" : "Kawandeep",
        "last" : "Virdee",
        "feature": true,
        "twitter" : "",
        "pic" : "kawandeepvirdee.jpg",
        "bio" : "Kawandeep Virdee works on new ways to create, remix, and share media at Embedly, building partnerships with companies across tech and media. He co-founded New American Public Art to build interactive art that makes public spaces more communal and welcoming. He is a trustee of the Boston chapter of the Awesome Foundation, and helps organize Boston Tech Poetics, exploring new ways of expression through technology. Previously, he researched at the New England Complex Systems Institute, using data mining and sentiment extraction to explore media sharing in social networks.",
        "sessions" : []
    },
    {
        "slug" : "una-kravets",
        "first" : "Una",
        "last" : "Kravets",
        "feature": true,
        "twitter" : "",
        "pic" : "una_kravets.jpg",
        "bio" : "Una Kravets is a UI Engineer on the Creative Engineering team at <a href='http://digitalocean.com'>DigitalOcean</a>. She’s a <a href='http://una.im'>technical writer</a>, having written for various online publications such as A List Apart and Sitepoint. Una also co-hosts the <a href='http://toolsday.io'>Toolsday</a> podcast and started both the DC and Austin Sass Meetups. She's a performance nerd, loves the open source community and listens to way too many audio books.",
        "sessions" : []
    },
    {
        "slug" : "potch",
        "first" : "Matt",
        "last" : "Claypotch",
        "feature": true,
        "twitter" : "",
        "pic" : "potch.jpg",
        "bio" : "Potch is a Web Developer Advocate at Mozilla. He's also the creator of <a href='http://unmaintained.tech/'>unmaintained.tech</a>, which encourages people to open source their software even when they don't have time to support it. When he's not building dashboards or making stickers, he's probably singing karaoke. Or singing in the car. Or shower.",
        "sessions" : []
    },
    {
        "slug" : "mike-taylor",
        "first" : "Mike",
        "last" : "Taylor",
        "feature": false,
        "twitter" : "",
        "pic" : "miketaylor.jpg",
        "bio" : "Mike Taylor is a Web Compatibility Engineer at Mozilla, working from Austin, TX. Previously he worked as a Web Opener at Opera Software, which is a funny title for pretty much the same thing.",
        "sessions" : []
    }
]
